Repository: js2854/shmcat
Catalog: po/*.po
Languages: de

source: Usage: %s [OPTION]... [OPERAND]...
de: Verwendung: %s [OPTION]... [OPERAND]...

source: Print files, shared memory segments and/or the given text to standard output.
de: Dateien, Shared-Memory-Segmente und/oder übergebenen Text auf der Standardausgabe ausgeben.

source: Following OPTIONs are supported:
de: Die folgenden OPTIONen werden unterstützt:

source: -h, --help display this help and exit. -? same as -h. -S, --stop stop immediately if there is an error with an operand. -V, --version output version information and exit.
de: -h, --help diesen Hilfetext anzeigen und beenden. -? das Gleiche wie -h. -S, --stop sofort anhalten, wenn ein Fehler mit einem Operanden auftritt. -V, --version Versionsinformationen anzeigen und beenden.

source: -h display this help and exit. -? same as -h. -S stop immediately if there is an error with an operand. -V output version information and exit.
de: -h diesen Hilfetext anzeigen und beenden. -? das Gleiche wie -h. -S sofort anhalten, wenn ein Fehler mit einem Operanden auftritt. -V Versionsinformationen anzeigen und beenden.

source: An OPERAND may be one of:
de: Ein OPERAND kann sein:

source: -f, --file=filename dump contents of the given file. -i, --stdin dump standard input. -M, --shmkey=key dump the System V shared memory segment with the given key. -m, --shmid=id dump the System V shared memory segment with the given id. -n, --newline add a line feed.
de: -f, --file=dateiname den Inhalt der angegebenen Datei ausgeben. -i, --stdin die Standardeingabe ausgeben. -M, --shmkey=schlüssel das System-V-Shared-Memory-Segment mit dem übergebenen Schlüssel ausgeben. -m, --shmid=id das System-V-Shared-Memory-Segment mit der übergebenen ID ausgeben. -n, --newline einen Zeilenumbruch hinzufügen.

source: -p, --posix-shm=name dump the POSIX shared memory segment with the given name.
de: -p, --posix-shm=name das POSIX-Shared-Memory-Segment mit dem angegebenen Namen ausgeben.

source: -t, --text=text print the given text.
de: -t, --text=text den übergebenen Text ausgeben.

source: -f filename dump contents of the given file. -i dump standard input. -M key dump the System V shared memory segment with the given key. -m id dump the System V shared memory segment with the given id. -n add a line feed.
de: -f dateiname den Inhalt der angegebenen Datei ausgeben. -i die Standardeingabe ausgeben. -M schlüssel das System-V-Shared-Memory-Segment mit dem übergebenen Schlüssel ausgeben. -m id das System-V-Shared-Memory-Segment mit der übergebenen ID ausgeben. -n einen Zeilenumbruch hinzufügen.

source: -p name dump the POSIX shared memory segment with the given name.
de: -p name das POSIX-Shared-Memory-Segment mit dem angegebenen Namen ausgeben.

source: -t text print the given text.
de: -t text den übergebenen Text ausgeben.

source: If no operand is given, read standard input.
de: Wenn kein Operand angegeben wurde, wird von der Standardeingabe gelesen.

source: Copyright (C) 2012, 2014, 2016 by Stefan Gast
de: Copyright © 2012, 2014, 2016 by Stefan Gast

source: This is free software. You may redistribute copies of it under the terms of the GNU General Public License <http://www.gnu.org/licenses/gpl.html>. There is NO WARRANTY, to the extent permitted by law.
de: Dies ist freie Software. Sie dürfen Kopien davon unter den Bedingungen der GNU General Public License <http://www.gnu.org/licenses/gpl.html> weiter- verbreiten. Es gibt KEINERLEI GARANTIEN, so weit wie es das Gesetz erlaubt.

source: Report bugs to: %s
de: Melden Sie Fehler im Programm oder der deutschen Übersetzung an: %s

source: %s: Wrong usage, try "%s -h" for more information!
de: %s: Falsche Verwendung, mehr Informationen mit „%s -h“.

source: %s: BUG: Unhandled command line option: %c
de: %s: BUG: Nicht behandelte Kommandozeilen-Option: %c

source: %s: BUG: One of the program routines returned an invalid value (%i)!
de: %s: BUG: Eine der Routinen im Programm hat einen ungültigen Wert zurückgegeben (%i)!

source: %s: Error writing to standard output: %s
de: %s: Fehler beim Schreiben auf die Standardausgabe: %s

source: %s: Error reading file "%s": %s
de: %s: Fehler beim Lesen der Datei „%s“: %s

source: %s: Error reading standard input: %s
de: %s: Fehler beim Lesen von der Standardeingabe: %s

source: %s: Cannot open file "%s": %s
de: %s: Kann die Datei „%s“ nicht öffnen: %s

source: %s: Error closing file "%s": %s
de: %s: Fehler beim Schließen der Datei „%s“: %s

source: %s: Cannot attach the shared memory segment with the key "%s": %s
de: %s: Kann das Shared-Memory-Segment mit dem Schlüssel „%s“ nicht einbinden: %s

source: %s: Cannot attach the shared memory segment with the id "%s": %s
de: %s: Kann das Shared-Memory-Segment mit der ID „%s“ nicht einbinden: %s

source: %s: Cannot determine the size of the shared memory segment with the key "%s": %s
de: %s: Kann die Größe des Shared-Memory-Segments mit dem Schlüssel „%s“ nicht ermitteln: %s

source: %s: Cannot determine the size of the shared memory segment with the id "%s": %s
de: %s: Kann die Größe des Shared-Memory-Segments mit der ID „%s“ nicht ermitteln: %s

source: %s: Invalid shared memory key: %s
de: %s: Ungültiger Shared-Memory-Schlüssel: %s

source: %s: "%s" is the key for private shared memory segments! Try passing the segment by ID instead.
de: %s: „%s“ ist der Schlüssel für private Shared-Memory-Segmente! Versuchen Sie das Segment über die ID zu übergeben.

source: %s: Cannot open a shared memory segment with the key "%s": %s
de: %s: Kann kein Shared-Memory-Segment mit dem Schlüssel „%s“ öffnen: %s

source: %s: Invalid shared memory id: %s
de: %s: Ungültige Shared-Memory-ID: %s

source: %s: Cannot open the shared memory segment with the name "%s": %s
de: %s: Kann das Shared-Memory-Segment mit dem Schlüssel „%s“ nicht öffnen: %s

source: %s: Cannot determine the size of the shared memory segment with the name "%s": %s
de: %s: Kann die Größe des Shared-Memory-Segments mit dem Name „%s“ nicht ermitteln: %s

source: %s: Cannot attach the shared memory segment with the name "%s": %s
de: %s: Kann das Shared-Memory-Segment mit dem Name „%s“ nicht einbinden: %s

source: Usage: %s [OPTION] FILENAME ID
de: Verwendung: %s [OPTION] DATEINAME ID

source: Calculate a System V interprocess communication key using the ftok(3) library function and print the result to standard output.
de: Berechne über die Bibliotheksfunktion ftok(3) einen System V Interprozesskommunikations-Schlüssel und gebe das Ergebnis auf der Standardausgabe aus.

source: -d, --decimal decimal output (instead of hexadecimal). -o, --octal octal output (instead of hexadecimal).
de: -d, --decimal dezimale Ausgabe (statt hexadezimal). -o, --octal oktale Ausgabe (statt hexadezimal).

source: -h, --help display this help and exit. -? same as -h. -V, --version output version information and exit.
de: -h, --help diesen Hilfetext anzeigen und beenden. -? das Gleiche wie -h. -V, --version Versionsinformationen anzeigen und beenden.

source: -d decimal output (instead of hexadecimal). -o octal output (instead of hexadecimal).
de: -d dezimale Ausgabe (statt hexadezimal). -o oktale Ausgabe (statt hexadezimal).

source: -h display this help and exit. -? same as -h. -V output version information and exit.
de: -h diesen Hilfetext anzeigen und beenden. -? das Gleiche wie -h. -V Versionsinformationen anzeigen und beenden.

source: %s, part of %s
de: %s, Teil von %s

source: Copyright (C) 2012, 2014 by Stefan Gast
de: Copyright © 2012, 2014 by Stefan Gast

source: %s: The ID has to be a number between 0 and 255!
de: %s: Die ID muss eine Zahl zwischen 0 und 255 sein!

source: %s: Cannot calculate a key for the given parameters: %s
de: %s: Kann keinen Schlüssel für die angegebenen Parameter berechnen: %s

source: %s: Cannot print to standard output: %s
de: %s: Fehler beim Schreiben auf die Standardausgabe: %s
